## 2.2. Problem Statement: Pandas

In [1]:
import pandas as pd

#### Problem Statement 1:
1) How-to-count-distance-to-the-previous-zero
For each value, count the difference of the distance from the previous zero (or the start of
the Series, whichever is closer) and if there are no previous zeros, print the position
Consider a DataFrame df where there is an integer column {'X'[7, 2, 0, 3, 4, 2, 5, 0, 3, 4]}
The values should therefore be [1, 2, 0, 1, 2, 3, 4, 0, 1, 2]. Make this a new column 'Y'.
import pandas as pd
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})

In [2]:
#Create Dictionary
dic = {'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]}

#Create data frame
df = pd.DataFrame(dic)

#dictionary to hold distance previous zero values
distPreviousValues = {'Y':[]}

index = -1
for i in range(len(df.X)):
    if(df.X[i] == 0):
        index = i
        
    if(index == -1):
        distPreviousValues['Y'].append(i+1)
    else:
        distPreviousValues['Y'].append(i - index)

seri = pd.Series(distPreviousValues['Y'],name="Y")
df.join(seri)

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

2). Create a DatetimeIndex that contains each business day of 2015 and use it to index a
Series of random numbers.

In [63]:
import numpy as np
from numpy import random as rm
dateRange = pd.date_range(start='2015-01-01', end='2015-12-31', freq='B') 
s = pd.Series(np.random.rand(len(dateRange)), index=dateRange)
s

2015-01-01    0.709379
2015-01-02    0.465165
2015-01-05    0.025693
2015-01-06    0.055479
2015-01-07    0.260516
2015-01-08    0.614545
2015-01-09    0.616810
2015-01-12    0.805571
2015-01-13    0.100700
2015-01-14    0.879590
2015-01-15    0.407481
2015-01-16    0.737417
2015-01-19    0.761783
2015-01-20    0.572007
2015-01-21    0.205186
2015-01-22    0.866072
2015-01-23    0.083970
2015-01-26    0.310744
2015-01-27    0.790024
2015-01-28    0.359024
2015-01-29    0.544899
2015-01-30    0.198889
2015-02-02    0.094553
2015-02-03    0.189826
2015-02-04    0.104390
2015-02-05    0.404365
2015-02-06    0.991150
2015-02-09    0.489333
2015-02-10    0.408505
2015-02-11    0.277406
                ...
2015-11-20    0.763935
2015-11-23    0.744057
2015-11-24    0.021077
2015-11-25    0.423560
2015-11-26    0.171372
2015-11-27    0.524278
2015-11-30    0.333020
2015-12-01    0.933036
2015-12-02    0.997106
2015-12-03    0.434162
2015-12-04    0.899363
2015-12-07    0.306964
2015-12-08    0.811607
2015-12-09    0.653371
2015-12-10    0.762045
2015-12-11    0.079456
2015-12-14    0.600327
2015-12-15    0.702465
2015-12-16    0.692944
2015-12-17    0.764351
2015-12-18    0.825571
2015-12-21    0.215955
2015-12-22    0.160374
2015-12-23    0.653652
2015-12-24    0.520386
2015-12-25    0.598992
2015-12-28    0.363328
2015-12-29    0.468175
2015-12-30    0.351781
2015-12-31    0.512636
Freq: B, Length: 261, dtype: float64

3) Find the sum of the values in s for every Wednesday

In [64]:
from datetime import datetime

s[dateRange.weekday == 2].sum()

26.05455955969519

4) Average For each calendar month

In [66]:
s.resample('M').mean()

2015-01-31    0.471407
2015-02-28    0.447021
2015-03-31    0.530926
2015-04-30    0.599710
2015-05-31    0.491358
2015-06-30    0.439136
2015-07-31    0.501195
2015-08-31    0.587502
2015-09-30    0.485438
2015-10-31    0.448443
2015-11-30    0.512910
2015-12-31    0.578611
Freq: M, dtype: float64

5) For each group of four consecutive calendar months in s, find the date on which the highest
value occurred.

In [80]:
s.groupby(pd.Grouper(freq='4M')).idxmax()

2015-01-31   2015-01-14
2015-05-31   2015-02-06
2015-09-30   2015-06-30
2016-01-31   2015-12-02
dtype: datetime64[ns]

#### Problem Statement 2:

Read the dataset from the below link
https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Nam
es_right.csv

In [7]:
dfbabyName = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")
dfbabyName.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

1) Delete unnamed columns

In [8]:
dfbabyName.drop('Unnamed: 0',1,inplace= True)
dfbabyName.head()

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

2)Show the distribution of male and female

In [9]:
groupbyGender = dfbabyName.groupby('Gender').sum().pipe(lambda group:group.Count/group.Count.sum()*100)
groupbyGender

Gender
F    46.243939
M    53.756061
Name: Count, dtype: float64

3)Show the top 5 most preferred names

In [10]:
mostpref = dfbabyName.groupby(['Name'])['Count'].sum()
df =mostpref.to_frame()
df.sort_values('Count',ascending=False).head()

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

4)What is the median name occurrence in the dataset

In [11]:
df = dfbabyName.median()
medId = df['Id']

print(dfbabyName[dfbabyName['Id'] == medId]['Name'])

508197    Kasey
Name: Name, dtype: object

5) Distribution of male and female born count by states

In [12]:
#dfbabyName.groupby(['Gender','State']).sum()
df = dfbabyName.groupby(['Gender','State']).sum()
df.pipe(lambda group:group.Count/group.Count.sum()*100)

Gender  State
F       AK       0.074108
        AL       0.607846
        AR       0.366196
        AZ       1.040518
        CA       6.815249
        CO       0.736290
        CT       0.399052
        DC       0.099589
        DE       0.088398
        FL       2.584369
        GA       1.551705
        HI       0.105244
        IA       0.408690
        ID       0.205548
        IL       1.962966
        IN       0.973878
        KS       0.415612
        KY       0.593428
        LA       0.626340
        MA       0.830671
        MD       0.762009
        ME       0.123422
        MI       1.357904
        MN       0.781684
        MO       0.869099
        MS       0.359508
        MT       0.089273
        NC       1.414822
        ND       0.084847
        NE       0.251254
                   ...
M       ME       0.157108
        MI       1.572746
        MN       0.900349
        MO       1.030233
        MS       0.453962
        MT       0.124622
        NC       1.630448
        ND       0.111534
        NE       0.317234
        NH       0.159457
        NJ       1.377412
        NM       0.320546
        NV       0.440515
        NY       3.309135
        OH       1.943292
        OK       0.645408
        OR       0.591294
        PA       1.927386
        RI       0.135339
        SC       0.670333
        SD       0.128292
        TN       1.125348
        TX       5.661518
        UT       0.692585
        VA       1.318050
        VT       0.060283
        WA       1.116207
        WI       0.880138
        WV       0.264125
        WY       0.061861
Name: Count, Length: 102, dtype: float64